---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.DistanceMeasuredFrom
source: html/f93ebb36-8b02-6953-5f85-70d5b6473c14.htm
---
# Autodesk.Revit.DB.WallSweepInfo.DistanceMeasuredFrom Property

Indicates if Distance is measured from the top or bottom of the wall.

## Syntax (C#)
```csharp
public DistanceMeasuredFrom DistanceMeasuredFrom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration